/*
2.輸入一個圓半徑（r）當r>＝0時，計算並輸出圓的面積和周長，否則，輸出提示資訊。
2.輸入一個圓半徑（r）當r>＝0時，計算並輸出圓的面積(pi *r*r )和周長(2*pi*r) pi = 3.14，否則，輸出提示資訊
3. 輸入年分，輸出閏年判斷

4. 輸入年 月, 輸出當月天數

5. 內容： 某校為了不讓學生互相比較成績，所以成績上記錄的是成績等第而不是分數，它的規則如下：

	90分(含)~100分(含)為A等
	80分(含)~90分(不含)為B等
	70分(含)~80分(不含)為C等
	60分(含)~70分(不含)為D等
	不滿60分者為E等
 	現在給你一個成績，請你判斷它是哪一個等第。
*/

#include <stdio.h>

int main()
{
    int x,y;
    
    printf("please input int x=");
    scanf("%d",&x);
   
    printf("x*x*y = %d\n","y=3.14 = %d\n",x*x*y); 
    printf("2*x*3.14 = %d\n",2*x*3.14);

    return 0;
}
